clear B;
% 다음 안내가 나올 때까지 프로그래머가 Subgroup을 입력하셔야
% Normal 여부를 판단합니다.
%=========================================================================
B(:,:,1)=[0 0 1 0; 0 0 0 1; 1 0  0 0; 0  1 0 0];

%=========================================================================
% 여기부터는 컴퓨터가 Normal 여부를 판단하겠습니다.
% 사전에 sgroup을 실행시켜서 같은 크기의 Sn그룹을 만들어 주십시오.

M=size(A);L=size(B); % 사이즈측정 =========================================
if size(L)==[1 3]
    L=L(3);
else
    L=1;
end
n=M(1); %=================================================================

op=0;qw=0;er=0; % 연산자 준비
jkl=L+1; % 확장 준비

while er==0
    er=1;
    for l=1:jkl-1 % Conjugate 들의 추가 ==================================
        for m=1:factorial(n)
            C=A(:,:,m)*B(:,:,l)*inv(A(:,:,m));
            for k=1:jkl-1
                S=0; % 행렬의 항등여부 조사 ===============================
                for i=1:n
                    for j=1:n
                        S=S+(C(i,j)~=B(i,j,k));
                    end
                end %=====================================================
                
                if S==0
                    op=1;
                end
            end
            if op==0
                B(:,:,jkl)=C;
                jkl=jkl+1;
                qw=1;er=0;
            end
            op=0;
        end
    end %=================================================================
    
    for l=1:jkl-1 % Group의 연산에 닫히도록 조정 ==========================
        for m=1:jkl-1
            C=B(:,:,l)*B(:,:,m);
            for k=1:jkl-1
                S=0; % 행렬의 항등여부 조사 ===============================
                for i=1:n
                    for j=1:n
                        S=S+(C(i,j)~=B(i,j,k));
                    end
                end %=====================================================
                
                if S==0
                    op=1;
                end
            end
            if op==0
                B(:,:,jkl)=C;
                jkl=jkl+1;
                qw=1;er=0;
            end
            op=0;
        end
    end %=================================================================
end

if qw==0
    B
    disp('정의하신 그룹은 Sn의 Normal subgroup이 맞습니다.');
else
    B
    disp('정의하신 그룹은 Sn의 Normal subgroup이 아니라');
    disp('Normal subgroup으로 확장했습니다.');
end
